"""
Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать.
"""
my_list = ["n", "o", "h","t","y","p"]
my_string = ''.join(my_list)[::-1]
print(my_string)
